#+OPTIONS: ^:nil
# above: disables undercore-to-subscript when exporting

<2017-01-28 Sa> - ?

#+BEGIN_VERSE
Diese orgmode-Datei formatiert anschauen
Inhalt kopieren in [[http://mooz.github.io/org-js/][Online Orgmode Viewer]] - Editor
#+END_VERSE

#+OPTIONS: toc:2

** Destructors Dtor & RAII
   - Need to be defined IFF class has =DynMem= members.
   - =RAII= = "Allocation is Acquisition" programming paradigm. Here means that
     class resources (like e.g. =DynMem= array, =file= or Database) should be
     initialized in Ctor, and freed in Dtor.
   - Example:
   #+BEGIN_SRC C++ :includes <iostream> <thread> <assert.h> :libs -lpthread :results output
   using namespace std;
   class R{
   private:
     int *arr; int len;
   public:
     R(int leng): len(leng)
     { assert(len>0); arr = new int[len]; cout << "constred" << endl;}
     ~R(){ delete[] arr; cout << "destred" << endl;}
     void setVal(int i, int val){ arr[i]=val; }
   };
   int main(){
     R r(10); /*set values, do stuff*/
   }// ~R() is called here
   #+END_SRC

   #+RESULTS:
   : constred
   : destred

   
** [BoQuian] Shared_Pointer =SharedPtr=
   [[file:websnippets/arrays-ptrs-ref/BoQuian_SmartPointers/main.cpp][Code: websnippets > arrs-ptrs > SmartPtrs]] just copy-pasted in here:
   #+BEGIN_SRC C++ :includes <iostream> <thread> :libs -lpthread :results output
     #include <cstdlib>
     #include <string>
     #include <memory> //smartPtrs

     using namespace std;

     class Dog{
     protected:
         string name;
         public:
             Dog(string name) : name{name} { cout << "A new Dawg has risen, he's " << name << endl;}
             Dog(){ cout << "A new Nameless Dog, probably a wolf" << endl;}
             ~Dog(){ cout << "Dog " << name << " HAS BEEN DESTROYED (by argument)!" << endl;}
             virtual void bark(){ cout << "Woof, said " << name << endl;}
     };

     class Hound : public Dog{
     public: Hound(string name) : Dog(name){}
     void bark(){ cout << "I'm a Hound, no matter what you point at me!, said " << name << endl;}
     };

     void oldWay_dontCallThis(){ //dont do this anymore
         Dog *p = new Dog("TheGood");
         //...
     //    delete p; //OH NO!
         //...
         p->bark(); //danglingPtr undefined behaviour
     } //memory leak if not deleted

     void newWay_callThis_Uhoh(){
     //    shared_ptr<Dog> p(new Dog("TheBad"));
         shared_ptr<Dog> p = make_shared<Dog>("The Ugly"); //yes! //p.use_count()=1
         {
             shared_ptr<Dog> p2 = make_shared<Dog>("Pepe"); //que? //count=2
             p2->bark();
         }//count=1
     }//count=0

     void rawPtrsShouldNotBeUsedAgain(){
         Dog *d = new Dog();
         shared_ptr<Dog> p(d); //count=1
         shared_ptr<Dog> p2(d); //count=1! if one goes out of scope, the other is dangling!
         /*assign obj to smartPtr AS SOON AS IT IS CREATED!*/
     }

     void commonPointerOperationsWithSmartPtrs(){
         shared_ptr<Hound> p = make_shared<Hound>("Zuzu");
         p->bark(); //arrow!
         (*p).bark(); //dereference!
         //SPECIAL castFcts for SmartPtrs!
         shared_ptr<Dog> p2 = static_pointer_cast<Dog>(p);
         shared_ptr<Dog> p3 = dynamic_pointer_cast<Dog>(p);
     //    shared_ptr<Dog> p4 = const_pointer_cast<Dog>(p); //error!
         p2->bark(); //still a Hound deep inside
         p3->bark(); //still a Hound deep inside
     }

     void whenSmartPtrsGoOutOfScope(){
         shared_ptr<Dog> p1 = make_shared<Dog>("The Ugly");
         shared_ptr<Dog> p2 = make_shared<Dog>("Rantanplan");
         shared_ptr<Dog> p3 = p2;
         p1 = p2; //The Ugly is DESTROYED!
         p2 = nullptr; //Responsibility moved to p3
         p3.reset(); //Rantanplan is DESTROYED!
     }
     void usingACustomDeleterOnAnArrayOfDogs(){
         /*in such a case the default deleter wont do. We create one with Lambda.*/
     //    shared_ptr<Dog> p3(new Dog[3]); //ptr just points to the first dog
         /*Deleting the ptr would just delete the first dog, memleak for dog2, dog3*/
    
         //custom deleter:
         shared_ptr<Dog> p4(new Dog[3], [](Dog *p){delete[] p;});   
     }
     /*
      ,* 
      ,*/
     int main(int argc, char** argv) {
    
     //    oldWay_dontCallThis();
         newWay_callThis_Uhoh();
         cout << endl;
     //    rawPtrsShouldNotBeUsedAgain();
         commonPointerOperationsWithSmartPtrs();
         cout << endl;
         whenSmartPtrsGoOutOfScope();
         cout << endl;
         usingACustomDeleterOnAnArrayOfDogs();

         return 0;
     }   
   #+END_SRC

   #+RESULTS:
   #+begin_example
   A new Dawg has risen, he's The Ugly
   A new Dawg has risen, he's Pepe
   Woof, said Pepe
   Dog Pepe HAS BEEN DESTROYED (by argument)!
   Dog The Ugly HAS BEEN DESTROYED (by argument)!

   A new Dawg has risen, he's Zuzu
   I'm a Hound, no matter what you point at me!, said Zuzu
   I'm a Hound, no matter what you point at me!, said Zuzu
   I'm a Hound, no matter what you point at me!, said Zuzu
   I'm a Hound, no matter what you point at me!, said Zuzu
   Dog Zuzu HAS BEEN DESTROYED (by argument)!

   A new Dawg has risen, he's The Ugly
   A new Dawg has risen, he's Rantanplan
   Dog The Ugly HAS BEEN DESTROYED (by argument)!
   Dog Rantanplan HAS BEEN DESTROYED (by argument)!

   A new Nameless Dog, probably a wolf
   A new Nameless Dog, probably a wolf
   A new Nameless Dog, probably a wolf
   Dog  HAS BEEN DESTROYED (by argument)!
   Dog  HAS BEEN DESTROYED (by argument)!
   Dog  HAS BEEN DESTROYED (by argument)!
   #+end_example
   
     
